Repository: Pylons/colander
Catalog: src/colander/locale/*/LC_MESSAGES/colander.po
Languages: fr

source: Invalid value
fr: Valeur incorrecte

source: String does not match expected pattern
fr: La chaîne de caractères ne correspond pas au modèle attendu

source: Invalid email address
fr: Adresse email invalide

source: ${val} is less than minimum value ${min}
fr: ${val} est plus petit que la valeur minimale autorisée (${min})

source: ${val} is greater than maximum value ${max}
fr: ${val} est plus grand que la valeur maximum autorisée (${max})

source: Shorter than minimum length ${min}
fr: La longueur est inférieure à la taille minimum autorisée (${min})

source: Longer than maximum length ${max}
fr: La longueur dépasse la taille maximum autorisée (${max})

source: "${val}" is not one of ${choices}
fr: "${val}" ne fait pas partie des choix suivants ${choices}

source: One or more of the choices you made was not acceptable
fr: Un ou plusieurs choix invalides

source: Must be a URL
fr: Doit être une URL valide

source: "${val}" is not a mapping type: ${err}
fr: "${val}" n'est pas du type table de correspondance (dictionnaire par exemple): ${err}

source: Unrecognized keys in mapping: "${val}"
fr: Clé inconnue dans dans la table de correspondance: "${val}"

source: "${val}" is not iterable
fr: "${val}" n'est pas itérable

source: "${val}" has an incorrect number of elements (expected ${exp}, was ${was})
fr: "${val}" possède un nombre incorrect d'éléments (attendu ${exp}, trouvé ${was})

source: ${cstruct} is not iterable
fr: ${cstruct} n'est pas itérable

source: ${val} cannot be serialized: ${err}
fr: ${val} ne peut être sérialisé: ${err}

source: ${val} is not a string: ${err}
fr: ${val} n'est pas une chaîne de caractères: ${err}

source: "${val}" is not a number
fr: "${val}" n'est pas un nombre

source: ${val} is not a string
fr: ${val} n'est pas une chaîne de caractères

source: "${val}" is neither in (${false_choices}) nor in (${true_choices})
fr: "${val}" ne fait partie ni de (${false_choices}) ni de (${true_choices})

source: relative name "${val}" irresolveable without package
fr: le nom relatif "${val}" ne peut-être résolu sans son module intégré

source: "${val}" has no __name__
fr: "${val}" ne possède pas l'attribut __name__

source: "${val}" is not a string
fr: "${val}" n'est pas une chaîne de caractères

source: The dotted name "${name}" cannot be imported
fr: Le symbole python "${name}" n'a pu être importé

source: Invalid date
fr: Date invalide

source: "${val}" is not a datetime object
fr: "${val}" n'est pas un objet datetime

source: "${val}" is not a date object
fr: "${val}" n'est pas un objet date

source: Invalid time
fr: Heure invalide

source: "${val}" is not a time object
fr: "${val}" n'est pas un objet time

source: Required
fr: Requis
